Revit 2024 API
SystemsAnalysisOptions Constructor
 Constructs a new instance of the options.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public SystemsAnalysisOptions()
Visual Basic
Public Sub New
Visual C++
public:
SystemsAnalysisOptions()
See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace